; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v1 - type_3 ?v8 - type_2)
 	      (pred_1 ?v4 - object ?v8 - type_2)
	      (pred_4 ?v1 - type_3 ?v5 - type_1)
	      (pred_2 ?v1 - type_3 ?v4 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v1 - type_3 ?v2 ?v7 - type_2)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v7)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v3 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v6 ?v3) (pred_3 ?v1 ?v3) (pred_4 ?v1 ?v5))
       :effect (and (pred_2 ?v1 ?v6 ?v5)
		    (not (pred_1 ?v6 ?v3)) 
		    (not (pred_4 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_3 ?v6 - object ?v3 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v6 ?v5) (pred_3 ?v1 ?v3))
       :effect (and (pred_1 ?v6 ?v3)
		    (pred_4 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v6 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_09 obj_04 - type_1
obj_03 obj_02 obj_10 obj_07 - type_2
obj_08 obj_05 obj_06 - object)
(:init
(pred_3 obj_01 obj_03)
(pred_4 obj_01 obj_09)
(pred_4 obj_01 obj_04)
(pred_1 obj_08 obj_07)
(pred_1 obj_05 obj_10)
(pred_1 obj_06 obj_10)
)
(:goal
(and
(pred_1 obj_08 obj_02)
(pred_1 obj_05 obj_03)
(pred_1 obj_06 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_04))))
)
)

; plan
1. (op_3 obj_01 obj_03 obj_10)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_10)
   goals met: 0 of 3
2. (op_1 obj_01 obj_05 obj_10 obj_09)
   deleted: (pred_1 obj_05 obj_10) (pred_4 obj_01 obj_09)
   added: (pred_2 obj_01 obj_05 obj_09)
   goals met: 0 of 3
3. (op_3 obj_01 obj_10 obj_03)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_03)
   goals met: 0 of 3
4. (op_2 obj_01 obj_05 obj_03 obj_09)
   deleted: (pred_2 obj_01 obj_05 obj_09)
   added: (pred_1 obj_05 obj_03) (pred_4 obj_01 obj_09)
   goals met: 1 of 3
5. (op_3 obj_01 obj_03 obj_07)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_07)
   goals met: 1 of 3
6. (op_1 obj_01 obj_08 obj_07 obj_09)
   deleted: (pred_1 obj_08 obj_07) (pred_4 obj_01 obj_09)
   added: (pred_2 obj_01 obj_08 obj_09)
   goals met: 1 of 3
7. (op_3 obj_01 obj_07 obj_02)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_02)
   goals met: 1 of 3
8. (op_2 obj_01 obj_08 obj_02 obj_09)
   deleted: (pred_2 obj_01 obj_08 obj_09)
   added: (pred_1 obj_08 obj_02) (pred_4 obj_01 obj_09)
   goals met: 2 of 3
9. (op_3 obj_01 obj_02 obj_10)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_10)
   goals met: 2 of 3
10. (op_1 obj_01 obj_06 obj_10 obj_09)
   deleted: (pred_1 obj_06 obj_10) (pred_4 obj_01 obj_09)
   added: (pred_2 obj_01 obj_06 obj_09)
   goals met: 2 of 3
11. (op_3 obj_01 obj_10 obj_03)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_03)
   goals met: 2 of 3
12. (op_2 obj_01 obj_06 obj_03 obj_09)
   deleted: (pred_2 obj_01 obj_06 obj_09)
   added: (pred_1 obj_06 obj_03) (pred_4 obj_01 obj_09)
   goals met: 3 of 3
